README.org
#+title:  Frangipanni
#+author: Peter Birch
#+date:   2021-12-05
* frangipanni
  :PROPERTIES:
  :CUSTOM_ID: frangipanni
  :END:

Program to convert lines of text into beautiful tree structures.

The program reads each line on the standard input in turn. It breaks
each line into tokens, then adds the sequence of tokens into a tree
structure. Lines with the same leading tokens are placed in the same
branch of the tree. The tree is printed as indented lines or JSON
format. Alternatively the tree can be passed to a user-provided Lua
script which can produce any output format.

Options control where the line is broken into tokens, and how it is
analysed and output.

** Basic Operation
   :PROPERTIES:
   :CUSTOM_ID: basic-operation
   :END:

Here is a simple example. Given this command
=sudo find /etc -maxdepth 3 | tail -9=,

We get this data:

#+BEGIN_EXAMPLE
  /etc/bluetooth/rfcomm.conf.dpkg-remove
  /etc/bluetooth/serial.conf.dpkg-remove
  /etc/bluetooth/input.conf
  /etc/bluetooth/audio.conf.dpkg-remove
  /etc/bluetooth/network.conf
  /etc/bluetooth/main.conf
  /etc/fish
  /etc/fish/completions
  /etc/fish/completions/task.fish
#+END_EXAMPLE

When we pipe this into the =frangipanni= program :

#+BEGIN_EXAMPLE
  sudo find /etc -maxdepth 3 | tail -9 | frangipanni
#+END_EXAMPLE

we see this output:

#+BEGIN_EXAMPLE
  etc
      bluetooth
          rfcomm.conf.dpkg-remove
          serial.conf.dpkg-remove
          input.conf
          audio.conf.dpkg-remove
          network.conf
          main.conf
      fish/completions/task.fish
#+END_EXAMPLE

By default, it reads each line and splits them into tokens when it finds
a non-alphanumeric character.

In this next example we're processing a list of files produced by =find=
so we only want to break on directories. So we can specify =-breaks /=.

The default behaviour is to /fold/ tree branches with no sub-branches
into a single line of output. e.g. =fish/completions/task.fish= We turn
off folding by specifying the =-no-fold= option. With the refined
command

#+BEGIN_EXAMPLE
  frangipanni -breaks / -no-fold
#+END_EXAMPLE

We see this output

#+BEGIN_EXAMPLE
  etc
      bluetooth
          rfcomm.conf.dpkg-remove
          serial.conf.dpkg-remove
          input.conf
          audio.conf.dpkg-remove
          network.conf
          main.conf
      fish
          completions
              task.fish
#+END_EXAMPLE

Having restructured the data into a tree format we can output in other
formats. We can ask for JSON by adding the =-format json= option. We get
this output:

#+BEGIN_EXAMPLE
  {"etc" : 
      {"bluetooth" : 
          ["rfcomm.conf.dpkg-remove",
          "serial.conf.dpkg-remove",
          "input.conf",
          "audio.conf.dpkg-remove",
          "network.conf",
          "main.conf"],
      "fish" : 
          {"completions" : "task.fish"}}}
#+END_EXAMPLE

* Usage
  :PROPERTIES:
  :CUSTOM_ID: usage
  :END:

The command is a simple filter taking standard input, and output on
stdout.

#+BEGIN_SRC sh
  cat <input> | frangipanni [options]
#+END_SRC

** Options
   :PROPERTIES:
   :CUSTOM_ID: options
   :END:

#+BEGIN_EXAMPLE
    -breaks string
          Characters to slice lines with.
    -chars
          Slice line after every character.
    -counts
          Print number of matches at the end of the line.
    -depth int
          Maximum tree depth to print. (default 2147483647)
    -format string
          Format of output: indent|json (default "indent")
    -indent int
          Number of spaces to indent per level. (default 4)
    -level int
          Analyse down to this level (positive integer). (default 2147483647)
    -lua string
          Lua Script to run
    -no-fold
          Don't fold into one line.
    -order string
          Sort order input|alpha. Sort the childs either in input order or via character ordering (default "input")
    -separators
          Print leading separators.
    -skip int
          Number of leading fields to skip.
    -spacer string
          Characters to indent lines with. (default " ")
#+END_EXAMPLE

# '

* Examples
  :PROPERTIES:
  :CUSTOM_ID: examples
  :END:

