README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-05 Sun 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Frangipanni</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peter Birch" />
</head>
<body>
<div id="content">
<h1 class="title">Frangipanni</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#frangipanni">1. frangipanni</a>
<ul>
<li><a href="#basic-operation">1.1. Basic Operation</a></li>
</ul>
</li>
<li><a href="#usage">2. Usage</a>
<ul>
<li><a href="#options">2.1. Options</a></li>
</ul>
</li>
<li><a href="#examples">3. Examples</a>
<ul>
<li><a href="#log-files">3.1. Log files</a></li>
<li><a href="#data-from-environment-variables">3.2. Data from environment variables</a></li>
<li><a href="#split-the-path">3.3. Split the PATH</a></li>
<li><a href="#query-a-csv-triplestore---json">3.4. Query a CSV triplestore -&gt; JSON</a></li>
<li><a href="#security-analysis-of-sudo-use-in-auth-log-file">3.5. Security Analysis of sudo use in Auth Log File</a></li>
<li><a href="#output-for-spreadsheets">3.6. Output for Spreadsheets</a></li>
<li><a href="#output-for-markdown">3.7. Output for Markdown</a></li>
<li><a href="#lua-examples">3.8. Lua Examples</a>
<ul>
<li><a href="#json-again">3.8.1. JSON (again)</a></li>
<li><a href="#markdown">3.8.2. Markdown</a></li>
<li><a href="#xml">3.8.3. XML</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org437087a" class="outline-2">
<h2 id="frangipanni"><span class="section-number-2">1</span> frangipanni</h2>
<div class="outline-text-2" id="text-frangipanni">
<p>
Program to convert lines of text into beautiful tree structures.
</p>

<p>
The program reads each line on the standard input in turn. It breaks
each line into tokens, then adds the sequence of tokens into a tree
structure. Lines with the same leading tokens are placed in the same
branch of the tree. The tree is printed as indented lines or JSON
format. Alternatively the tree can be passed to a user-provided Lua
script which can produce any output format.
</p>

<p>
Options control where the line is broken into tokens, and how it is
analysed and output.
</p>
</div>

<div id="outline-container-org5d0b98b" class="outline-3">
<h3 id="basic-operation"><span class="section-number-3">1.1</span> Basic Operation</h3>
<div class="outline-text-3" id="text-basic-operation">
<p>
Here is a simple example. Given this command
<code>sudo find /etc -maxdepth 3 | tail -9</code>,
</p>

<p>
We get this data:
</p>

<pre class="example">
/etc/bluetooth/rfcomm.conf.dpkg-remove
/etc/bluetooth/serial.conf.dpkg-remove
/etc/bluetooth/input.conf
/etc/bluetooth/audio.conf.dpkg-remove
/etc/bluetooth/network.conf
/etc/bluetooth/main.conf
/etc/fish
/etc/fish/completions
/etc/fish/completions/task.fish
</pre>

<p>
When we pipe this into the <code>frangipanni</code> program :
</p>

<pre class="example">
sudo find /etc -maxdepth 3 | tail -9 | frangipanni
</pre>

<p>
we see this output:
</p>

<pre class="example">
etc
    bluetooth
        rfcomm.conf.dpkg-remove
        serial.conf.dpkg-remove
        input.conf
        audio.conf.dpkg-remove
        network.conf
        main.conf
    fish/completions/task.fish
</pre>

<p>
By default, it reads each line and splits them into tokens when it finds
a non-alphanumeric character.
</p>

<p>
In this next example we're processing a list of files produced by <code>find</code>
so we only want to break on directories. So we can specify <code>-breaks /</code>.
</p>

<p>
The default behaviour is to <i>fold</i> tree branches with no sub-branches
into a single line of output. e.g. =fish/completions/task.fish= We turn
off folding by specifying the <code>-no-fold</code> option. With the refined
command
</p>

<pre class="example">
frangipanni -breaks / -no-fold
</pre>

<p>
We see this output
</p>

<pre class="example">
etc
    bluetooth
        rfcomm.conf.dpkg-remove
        serial.conf.dpkg-remove
        input.conf
        audio.conf.dpkg-remove
        network.conf
        main.conf
    fish
        completions
            task.fish
</pre>

<p>
Having restructured the data into a tree format we can output in other
formats. We can ask for JSON by adding the <code>-format json</code> option. We get
this output:
</p>

<pre class="example">
{"etc" : 
    {"bluetooth" : 
        ["rfcomm.conf.dpkg-remove",
        "serial.conf.dpkg-remove",
        "input.conf",
        "audio.conf.dpkg-remove",
        "network.conf",
        "main.conf"],
    "fish" : 
        {"completions" : "task.fish"}}}
</pre>
</div>
</div>
</div>

<div id="outline-container-org603d52e" class="outline-2">
<h2 id="usage"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-usage">
<p>
The command is a simple filter taking standard input, and output on
stdout.
</p>

<div class="org-src-container">
<pre class="src src-sh">cat &lt;input&gt; | frangipanni [options]
</pre>
</div>
</div>

<div id="outline-container-org80b22e6" class="outline-3">
<h3 id="options"><span class="section-number-3">2.1</span> Options</h3>
<div class="outline-text-3" id="text-options">
<pre class="example">
-breaks string
      Characters to slice lines with.
-chars
      Slice line after every character.
-counts
      Print number of matches at the end of the line.
-depth int
      Maximum tree depth to print. (default 2147483647)
-format string
      Format of output: indent|json (default "indent")
-indent int
      Number of spaces to indent per level. (default 4)
-level int
      Analyse down to this level (positive integer). (default 2147483647)
-lua string
      Lua Script to run
-no-fold
      Don't fold into one line.
-order string
      Sort order input|alpha. Sort the childs either in input order or via character ordering (default "input")
-separators
      Print leading separators.
-skip int
      Number of leading fields to skip.
-spacer string
      Characters to indent lines with. (default " ")
</pre>
</div>
</div>
</div>
