README.org
** Log files
   :PROPERTIES:
   :CUSTOM_ID: log-files
   :END:

Given input from a log file:

#+BEGIN_EXAMPLE
  May 10 03:17:06 localhost systemd: Removed slice User Slice of root.
  May 10 03:17:06 localhost systemd: Stopping User Slice of root.
  May 10 04:00:00 localhost systemd: Starting Docker Cleanup...
  May 10 04:00:00 localhost systemd: Started Docker Cleanup.
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.629849861+10:00" level=debug msg="Calling GET /_ping"
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.629948000+10:00" level=debug msg="Unable to determine container for /"
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.630103455+10:00" level=debug msg="{Action=_ping, LoginUID=12345678, PID=21075}"
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.630684502+10:00" level=debug msg="Calling GET /v1.26/containers/json?all=1&filters=%7B%22status%22%3A%7B%22dead%22%3Atrue%7D%7D"
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.630704513+10:00" level=debug msg="Unable to determine container for containers"
  May 10 04:00:00 localhost dockerd-current: time="2020-05-10T04:00:00.630735545+10:00" level=debug msg="{Action=json, LoginUID=12345678, PID=21075}"
#+END_EXAMPLE

default output is:

#+BEGIN_EXAMPLE
  May 10
   03:17:06 localhost systemd
    : Removed slice User Slice of root
    : Stopping User Slice of root
   04:00:00 localhost
     dockerd-current: time="2020-05-10T04:00:00
      .629849861+10:00" level=debug msg="Calling GET /_ping
      .629948000+10:00" level=debug msg="Unable to determine container for
      .630103455+10:00" level=debug msg="{Action=_ping, LoginUID=12345678, PID=21075
      .630684502+10:00" level=debug msg="Calling GET /v1.26/containers/json?all=1&filters=%7B%22status%22%3A%7B%22dead%22%3Atrue%7D%7D
      .630704513+10:00" level=debug msg="Unable to determine container for containers
      .630735545+10:00" level=debug msg="{Action=json, LoginUID=12345678, PID=21075
     systemd
      : Started Docker Cleanup
      : Starting Docker Cleanup
#+END_EXAMPLE
# "

with the =-skip 5= option we can ignore the date and time at the
beginning of each line. The output is

#+BEGIN_EXAMPLE
  localhost
      systemd
          Removed slice User Slice of root
          Stopping User Slice of root
          Starting Docker Cleanup
          Started Docker Cleanup
      dockerd-current: time="2020-05-10T04:00:00
          629849861+10:00" level=debug msg="Calling GET /_ping
          629948000+10:00" level=debug msg="Unable to determine container for
          630103455+10:00" level=debug msg="{Action=_ping, LoginUID=12345678, PID=21075
          630684502+10:00" level=debug msg="Calling GET /v1.26/containers/json?all=1&filters=%7B%22status%22%3A%7B%22dead%22%3Atrue%7D%7D
          630704513+10:00" level=debug msg="Unable to determine container for containers
          630735545+10:00" level=debug msg="{Action=json, LoginUID=12345678, PID=21075
#+END_EXAMPLE
# "

** Data from environment variables
   :PROPERTIES:
   :CUSTOM_ID: data-from-environment-variables
   :END:

Give this input, from ~env | egrep '^XDG'~ :

#+BEGIN_EXAMPLE
  XDG_VTNR=2
  XDG_SESSION_ID=5
  XDG_SESSION_TYPE=x11
  XDG_DATA_DIRS=/usr/share:/usr/share:/usr/local/share
  XDG_SESSION_DESKTOP=plasma
  XDG_CURRENT_DESKTOP=KDE
  XDG_SEAT=seat0
  XDG_RUNTIME_DIR=/run/user/1000
  XDG_SESSION_COOKIE=fe37f2ef4-158904.727668-469753
#+END_EXAMPLE

And run with

#+BEGIN_EXAMPLE
  $ env | egrep '^XDG' | ./frangipanni -breaks '=_' -no-fold -format json
#+END_EXAMPLE

we get

#+BEGIN_EXAMPLE
  {"XDG" : 
      {"VTNR" : 2,
      "SESSION" : 
          {"ID" : 5,
          "TYPE" : "x11",
          "DESKTOP" : "plasma",
          "COOKIE" : "fe37f2ef4-158904.727668-469753"},
      "DATA" : 
          {"DIRS" : "/usr/share:/usr/share:/usr/local/share"},
      "CURRENT" : 
          {"DESKTOP" : "KDE"},
      "SEAT" : "seat0",
      "RUNTIME" : 
          {"DIR" : "/run/user/1000"}}}
#+END_EXAMPLE

** Split the PATH
   :PROPERTIES:
   :CUSTOM_ID: split-the-path
   :END:

#+BEGIN_EXAMPLE
  $ echo $PATH | tr ':' '\n' | ./frangipanni -separators
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  /home/alice
      /work/gopath/src/github.com/birchb1024/frangipanni
      /apps
          /textadept_10.8.x86_64
          /shellcheck-v0.7.1
          /Digital/Digital
          /gradle-4.9/bin
          /idea-IC-172.4343.14/bin
          /GoLand-173.3531.21/bin
          /arduino-1.6.7
      /yed
      /bin
  /usr
      /lib/jvm/java-8-openjdk-amd64/bin
      /local
          /bin
          /games
          /go/bin
      /bin
      /games
  /bin
#+END_EXAMPLE

** Query a CSV triplestore -> JSON
   :PROPERTIES:
   :CUSTOM_ID: query-a-csv-triplestore---json
   :END:

A CSV tiplestore is a simple way of recording a database of facts about
objects. Each line has a Subject, Object, Predicate structure.

#+BEGIN_SRC csv
  john1@jupiter,rdf:type,UnixAccount
  joanna,hasAccount,alice1@jupiter
  jupiter,defaultAccount,alice1
  alice2,hasAccount,evan1@jupiter
  felicity,hasAccount,john1@jupiter
  alice1@jupiter,rdf:type,UnixAccount
  kalpana,hasAccount,alice1@jupiter
  john1@jupiter,hasPassword,felicity-pw-8
  Production,was_hostname,jupiter
  alice1@jupiter,rdf:type,UnixAccount
  alice1@jupiter,hasPassword,alice-pw-2
#+END_SRC

In this example we want the data about the =jupiter= machine. We permute
the input records with awk and filter the JSON output with =jq=.

#+BEGIN_SRC sg
  $ cat test/fixtures/triples.csv | \
    awk -F, '{print $2,$1,$3; print $1, $2, $3; print $3, $2, $1}' | \
    ./frangipanni  -breaks ' ' -order alpha -format json -no-fold | \
    jq '."jupiter"'
#+END_SRC

#+BEGIN_SRC javascript
  {
    "defaultAccount": "alice1",
    "hasUser": [
      "alice1",
      "birchb1",
      "john1"
    ],
    "rdf:type": [
      "UnixMachine",
      "WasDmgr"
    ],
    "was_hostname": "Production"
  }
#+END_SRC

