README.org
** Security Analysis of sudo use in Auth Log File
   :PROPERTIES:
   :CUSTOM_ID: security-analysis-of-sudo-use-in-auth-log-file
   :END:

The Linux /var/log/auth.log file has timed records about =sudo= which
look like this:

#+BEGIN_EXAMPLE
  May 17 00:36:15 localhost sudo:   alice : TTY=pts/2 ; PWD=/home/alice ; USER=root ; COMMAND=/usr/bin/jmtpfs -o allow_other /tmp/s
  May 17 00:36:15 localhost sudo: pam_unix(sudo:session): session opened for user root by (uid=0)
  May 17 00:36:15 localhost sudo: pam_unix(sudo:session): session closed for user root
#+END_EXAMPLE

By skipping the date/time component of the lines, and specifying
=-counts= we can see a breakdown of the =sudo= commands used and how
many occurred. By placing the date/time data at the end of the input
lines we alse get a breakdown of the commands by hour of day.

#+BEGIN_SRC sh
  $ sudo cat /var/log/auth.log | grep sudo | \
      awk '{print substr($0,16),substr($0,1,15)}' | \
      ./frangipanni -breaks ' ;:'  -depth 5 -counts -separators
#+END_SRC

Produces

#+BEGIN_EXAMPLE
   localhost sudo: 125
      :   alice: 42
           : TTY=pts/2: 14
               ; PWD=/home/alice ; USER=root ; COMMAND=/usr/bin/jmtpfs: 5
               ; PWD=/home/alice/workspace/gopath/src/github.com/akice/frangipanni ; USER=root ; COMMAND=/usr/bin/find /etc -maxdepth 3 May 17 13: 9
           : TTY=pts/1 ; PWD=/home/alice/workspace/gopath/src/github.com/akice/frangipanni ; USER=root ; COMMAND=/bin/cat: 28
               /var/log/messages May 17 13:53:34: 1
               /var/log/auth.log May 17: 27
      : pam_unix(sudo:session): session: 83
           opened for user root by (uid=0) May 17: 42
               00: 5
               13: 28
               14: 9
           closed for user root May 17: 41
               00: 5
               13: 28
               14: 8
#+END_EXAMPLE

We can see alice has run 42 sudo commands, 28 of whuch were =cat=ing
files from /var.

** Output for Spreadsheets
   :PROPERTIES:
   :CUSTOM_ID: output-for-spreadsheets
   :END:

Inevitably you will need to output reports from frangipanni into a
spreadsheet. You can use the =-spacer= option to specify the
character(s) to use for indentation and before the counts. So with the
file list example from above and this command

#+BEGIN_SRC sh
  sudo find /etc -maxdepth 3 | tail -9 | frangipanni -no-fold -counts -indent 1 -spacer $'\t'
#+END_SRC

You will have a tab-separated output which can be imported to your
spreadsheet.

| etc                        | 9                       |   |
| bluetooth                  | 6                       |   |
|                            | rfcomm.conf.dpkg-remove | 1 |
|                            | serial.conf.dpkg-remove | 1 |
|                            | input.conf              | 1 |
|                            | audio.conf.dpkg-remove  | 1 |
|                            | network.conf            | 1 |
|                            | main.conf               | 1 |
| fish/completions/task.fish | 3                       |   |

** Output for Markdown
   :PROPERTIES:
   :CUSTOM_ID: output-for-markdown
   :END:

To use the output with markdown or other text-based tools, sepecify the
=-separator= option. This can be used by tools like =sed= to convert the
leading separator into the markup required. example to get a leading
minus sign for an un-numbered Markdown list, use =sed= to

#+BEGIN_SRC sh
  sudo find /etc -maxdepth 3 | tail -9 | frangipanni -separators | sed 's;/; - ;'
#+END_SRC

Which results in an indented bullet list:

#+BEGIN_QUOTE

  - etc

    - bluetooth

      - rfcomm.conf.dpkg-remove
      - serial.conf.dpkg-remove
      - input.conf
      - audio.conf.dpkg-remove
      - network.conf
      - main.conf

    - fish/completions/task.fish
#+END_QUOTE

** Lua Examples
   :PROPERTIES:
   :CUSTOM_ID: lua-examples
   :END:

*** JSON (again)
    :PROPERTIES:
    :CUSTOM_ID: json-again
    :END:

First, we are going tell frangipanni to output via a Lua program called
'json.lua', and we will format the json with the 'jp' program.

#+BEGIN_SRC sh
  $ <test/fixtures/simplechars.txt frangipanni -lua json.lua | jp @
#+END_SRC

The Lua script uses the =github.com/layeh/gopher-json= module which is
imported in the Lua. The data is made available in the variable
=frangipanni= which has a table for each node, with fields

- depth - in the tree starting from 0
- lineNumber - the token was first detected
- numMatched - the number of times the token was seen
- sep - separation characters preceding the token
- text - the token itself
- children - a table containing the child nodes

#+BEGIN_SRC lua
  local json = require("json")

  print(json.encode(frangipanni))
#+END_SRC

The output shows that all the fields of the parsed nodes are passed to
Lua in a Table. The root node is empty except for it's children. The Lua
script is therefore able to use the fields intelligently.

#+BEGIN_SRC javascript
  {
    "depth": 0,
    "lineNumber": -1,
    "numMatched": 1,
    "sep": "",
    "text": "",
    "children": {
      "1.2": {
        "children": [],
        "depth": 1,
        "lineNumber": 8,
        "numMatched": 1,
        "sep": "",
        "text": "1.2"
      },
      "A": {
        "children": [],
        "depth": 1,
        "lineNumber": 1,
        "numMatched": 1,
        "sep": "",
        "text": "A"
      },
#+END_SRC

*** Markdown
    :PROPERTIES:
    :CUSTOM_ID: markdown
    :END:

#+BEGIN_EXAMPLE
  function indent(n)
      for i=1, n do
          io.write("   ")
      end
  end

  function markdown(node)
      indent(node.depth)
      io.write("* ")
      print(node.text)
      for k, v in pairs(node.children) do
          markdown(v)
      end
  end

  markdown(frangipanni)
#+END_EXAMPLE

The output can look like this:

#+BEGIN_EXAMPLE
  * 
     * A
     * C
        * 2
        * D
     * x.a
        * 2
        * 1
     * Z
     * 1.2
#+END_EXAMPLE

*** XML
    :PROPERTIES:
    :CUSTOM_ID: xml
    :END:

The xml.lua script provided in the release outputs very basic XML format
which might suit simple inputs.

#+BEGIN_SRC xml
  <root count="1" sep="">
     <C count="2" sep="">
        <2 count="1" sep="."/>
        <D count="1" sep="."/>
     </C>
     <x.a count="3" sep="">
        <1 count="1" sep="."/>
        <2 count="1" sep="."/>
     </x.a>
     <Z count="1" sep=""/>
     <1.2 count="1" sep=""/>
     <A count="1" sep=""/>
  </root>
#+END_SRC
