README.html

<div id="outline-container-org473421b" class="outline-3">
<h3 id="security-analysis-of-sudo-use-in-auth-log-file"><span class="section-number-3">3.5</span> Security Analysis of sudo use in Auth Log File</h3>
<div class="outline-text-3" id="text-security-analysis-of-sudo-use-in-auth-log-file">
<p>
The Linux /var/log/auth.log file has timed records about <code>sudo</code> which
look like this:
</p>

<pre class="example">
May 17 00:36:15 localhost sudo:   alice : TTY=pts/2 ; PWD=/home/alice ; USER=root ; COMMAND=/usr/bin/jmtpfs -o allow_other /tmp/s
May 17 00:36:15 localhost sudo: pam_unix(sudo:session): session opened for user root by (uid=0)
May 17 00:36:15 localhost sudo: pam_unix(sudo:session): session closed for user root
</pre>

<p>
By skipping the date/time component of the lines, and specifying
<code>-counts</code> we can see a breakdown of the <code>sudo</code> commands used and how
many occurred. By placing the date/time data at the end of the input
lines we alse get a breakdown of the commands by hour of day.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sudo cat /var/log/auth.log | grep sudo | \
    awk '{print substr($0,16),substr($0,1,15)}' | \
    ./frangipanni -breaks ' ;:'  -depth 5 -counts -separators
</pre>
</div>

<p>
Produces
</p>

<pre class="example">
localhost sudo: 125
   :   alice: 42
        : TTY=pts/2: 14
            ; PWD=/home/alice ; USER=root ; COMMAND=/usr/bin/jmtpfs: 5
            ; PWD=/home/alice/workspace/gopath/src/github.com/akice/frangipanni ; USER=root ; COMMAND=/usr/bin/find /etc -maxdepth 3 May 17 13: 9
        : TTY=pts/1 ; PWD=/home/alice/workspace/gopath/src/github.com/akice/frangipanni ; USER=root ; COMMAND=/bin/cat: 28
            /var/log/messages May 17 13:53:34: 1
            /var/log/auth.log May 17: 27
   : pam_unix(sudo:session): session: 83
        opened for user root by (uid=0) May 17: 42
            00: 5
            13: 28
            14: 9
        closed for user root May 17: 41
            00: 5
            13: 28
            14: 8
</pre>

<p>
We can see alice has run 42 sudo commands, 28 of whuch were =cat=ing
files from /var.
</p>
</div>
</div>

<div id="outline-container-org7a50834" class="outline-3">
<h3 id="output-for-spreadsheets"><span class="section-number-3">3.6</span> Output for Spreadsheets</h3>
<div class="outline-text-3" id="text-output-for-spreadsheets">
<p>
Inevitably you will need to output reports from frangipanni into a
spreadsheet. You can use the <code>-spacer</code> option to specify the
character(s) to use for indentation and before the counts. So with the
file list example from above and this command
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo find /etc -maxdepth 3 | tail -9 | frangipanni -no-fold -counts -indent 1 -spacer $'\t'
</pre>
</div>

<p>
You will have a tab-separated output which can be imported to your
spreadsheet.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">etc</td>
<td class="org-left">9</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">bluetooth</td>
<td class="org-left">6</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">rfcomm.conf.dpkg-remove</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">serial.conf.dpkg-remove</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">input.conf</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">audio.conf.dpkg-remove</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">network.conf</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">main.conf</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">fish/completions/task.fish</td>
<td class="org-left">3</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgda70a14" class="outline-3">
<h3 id="output-for-markdown"><span class="section-number-3">3.7</span> Output for Markdown</h3>
<div class="outline-text-3" id="text-output-for-markdown">
<p>
To use the output with markdown or other text-based tools, sepecify the
<code>-separator</code> option. This can be used by tools like <code>sed</code> to convert the
leading separator into the markup required. example to get a leading
minus sign for an un-numbered Markdown list, use <code>sed</code> to
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo find /etc -maxdepth 3 | tail -9 | frangipanni -separators | sed 's;/; - ;'
</pre>
</div>

<p>
Which results in an indented bullet list:
</p>

<blockquote>
<p>

</p>

<ul class="org-ul">
<li>etc

<ul class="org-ul">
<li>bluetooth

<ul class="org-ul">
<li>rfcomm.conf.dpkg-remove</li>
<li>serial.conf.dpkg-remove</li>
<li>input.conf</li>
<li>audio.conf.dpkg-remove</li>
<li>network.conf</li>
<li>main.conf</li>
</ul></li>

<li>fish/completions/task.fish</li>
</ul></li>
</ul>
</blockquote>
</div>
</div>

<div id="outline-container-org32e4085" class="outline-3">
<h3 id="lua-examples"><span class="section-number-3">3.8</span> Lua Examples</h3>
<div class="outline-text-3" id="text-lua-examples">
</div>

<div id="outline-container-orgd2aa3d9" class="outline-4">
<h4 id="json-again"><span class="section-number-4">3.8.1</span> JSON (again)</h4>
<div class="outline-text-4" id="text-json-again">
<p>
First, we are going tell frangipanni to output via a Lua program called
'json.lua', and we will format the json with the 'jp' program.
</p>

<div class="org-src-container">
<pre class="src src-sh">$ &lt;test/fixtures/simplechars.txt frangipanni -lua json.lua | jp @
</pre>
</div>

<p>
The Lua script uses the <code>github.com/layeh/gopher-json</code> module which is
imported in the Lua. The data is made available in the variable
<code>frangipanni</code> which has a table for each node, with fields
</p>

<ul class="org-ul">
<li>depth - in the tree starting from 0</li>
<li>lineNumber - the token was first detected</li>
<li>numMatched - the number of times the token was seen</li>
<li>sep - separation characters preceding the token</li>
<li>text - the token itself</li>
<li>children - a table containing the child nodes</li>
</ul>

<div class="org-src-container">
<pre class="src src-lua">local json = require("json")

print(json.encode(frangipanni))
</pre>
</div>

<p>
The output shows that all the fields of the parsed nodes are passed to
Lua in a Table. The root node is empty except for it's children. The Lua
script is therefore able to use the fields intelligently.
</p>

<div class="org-src-container">
<pre class="src src-javascript">{
  "depth": 0,
  "lineNumber": -1,
  "numMatched": 1,
  "sep": "",
  "text": "",
  "children": {
    "1.2": {
      "children": [],
      "depth": 1,
      "lineNumber": 8,
      "numMatched": 1,
      "sep": "",
      "text": "1.2"
    },
    "A": {
      "children": [],
      "depth": 1,
      "lineNumber": 1,
      "numMatched": 1,
      "sep": "",
      "text": "A"
    },
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd00a4f7" class="outline-4">
<h4 id="markdown"><span class="section-number-4">3.8.2</span> Markdown</h4>
<div class="outline-text-4" id="text-markdown">
<pre class="example">
function indent(n)
    for i=1, n do
        io.write("   ")
    end
end

function markdown(node)
    indent(node.depth)
    io.write("* ")
    print(node.text)
    for k, v in pairs(node.children) do
        markdown(v)
    end
end

markdown(frangipanni)
</pre>

<p>
The output can look like this:
</p>

<pre class="example">
* 
   * A
   * C
      * 2
      * D
   * x.a
      * 2
      * 1
   * Z
   * 1.2
</pre>
</div>
</div>

<div id="outline-container-orgf35a06f" class="outline-4">
<h4 id="xml"><span class="section-number-4">3.8.3</span> XML</h4>
<div class="outline-text-4" id="text-xml">
<p>
The xml.lua script provided in the release outputs very basic XML format
which might suit simple inputs.
</p>

<div class="org-src-container">
<pre class="src src-xml">&lt;root count="1" sep=""&gt;
   &lt;C count="2" sep=""&gt;
      &lt;2 count="1" sep="."/&gt;
      &lt;D count="1" sep="."/&gt;
   &lt;/C&gt;
   &lt;x.a count="3" sep=""&gt;
      &lt;1 count="1" sep="."/&gt;
      &lt;2 count="1" sep="."/&gt;
   &lt;/x.a&gt;
   &lt;Z count="1" sep=""/&gt;
   &lt;1.2 count="1" sep=""/&gt;
   &lt;A count="1" sep=""/&gt;
&lt;/root&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-12-05</p>
<p class="author">Author: Peter Birch</p>
<p class="date">Created: 2021-12-05 Sun 13:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
